#tap 
tap "homebrew/cask-fonts"
tap "1password/tap"
tap "koekeishiya/formulae"
tap "FelixKratz/formulae"
tap "hashicorp/tap"

#brew
brew "awscli"
brew "rename"
brew "hashicorp/tap/terraform"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "deno"
brew "wget"
brew "jq"
brew "gh"
brew "git"
brew "yabai"
brew "sketchybar"
brew "bat"
brew "powerlevel10k"
brew "nvm"
brew "zsh-autosuggestions"
brew "stow"
brew "neovim"
brew "exa"
brew "skhd"

#cask
cask "1password"
cask "1password-cli"
cask "caffeine"
cask "arc"
cask "azure-data-studio"
cask "discord"
cask "docker"
cask "dozer"
cask "dotnet"
cask "firefox"
cask "font-fira-code"
cask "font-symbols-only-nerd-font"
cask "font-hack-nerd-font"
cask "kitty"
cask "logitech-options"
cask "notion"
cask "raycast"
cask "spotify"
cask "telegram"
cask "visual-studio-code"

#vscode
vscode "4ops.terraform"
vscode "andrewleedham.vscode-css-modules"
vscode "austenc.tailwind-docs"
vscode "bbenoist.shell"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.dotnet-test-explorer"
vscode "ghmcadams.lintlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "henoc.svgeditor"
vscode "Ionide.Ionide-fsharp"
vscode "ionutvmi.path-autocomplete"
vscode "jock.svg"
vscode "mattpocock.ts-error-translator"
vscode "mikestead.dotenv"
vscode "Nixon.env-cmd-file-syntax"
vscode "PKief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "quentinguidee.gitignore-ultimate"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "sanity-io.vscode-sanity"
vscode "stylelint.vscode-stylelint"
vscode "tomoki1207.pdf"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "waderyan.gitblame"
vscode "zhuangtongfa.material-theme"
